{"data":{"site":{"siteMetadata":{"title":"Felfele Foundation","author":"Mark Vujevits"}},"markdownRemark":{"id":"2f0cb749-0960-53d0-b9d0-04442885bf60","excerpt":"Felfele User Manual 1.0.0 If you are interested in the feature set of the Felfele mobile app, you are at a good place. For more information…","html":"<h1>Felfele User Manual 1.0.0</h1>\n<p>If you are interested in the feature set of the Felfele mobile app, you are at a good place. For more information about the release, check out the <a href=\"https://felfele.com/blog/alpha\">announcement</a></p>\n<h2>Table of Contents</h2>\n<ol>\n<li><a href=\"#Onboarding\">Onboarding</a></li>\n<li><a href=\"#Home\">Home</a></li>\n<li><a href=\"#Favorites\">Favorites</a></li>\n<li><a href=\"#Posting\">Post Editor</a></li>\n<li><a href=\"#Profile\">Profile</a></li>\n<li><a href=\"#Settings\">Settings</a></li>\n<li><a href=\"#Channels\">Channels</a></li>\n<li><a href=\"#TabBar\">TabBar</a></li>\n<li><a href=\"#Post\">Post</a></li>\n<li><a href=\"#AddChannel\">Add Channel</a></li>\n</ol>\n<h2>Onboarding</h2>\n<p>First page introduces the Felfele app and the Foundation, contains a link to the website and a continue button.\nOn the following page you can select a profile picture, and you have to add a name, which will appear in your posts. By pressing done, your channel will be created, and you can start using the application.</p>\n<h2>Home</h2>\n<p>This is the default screen of the app. The posts from all the channels you follow are displayed here, including yours. The top of the feed includes the “What’s up?” box, if you click on it, the app navigates opens the Post Editor. On the right there’s the camera icon, which is a shortcut to creating a post with an image. The left button in the Navigation Header gives access to the list of <a href=\"#Channels\">channels</a> of the home screen. With the button on the right you can quickly start following a new channel.</p>\n<h2>Favorites</h2>\n<p>The posts from your favorited channels are displayed here, including yours. The left button in the Navigation Header gives access to the list of your favorite channels. </p>\n<h2>Posting</h2>\n<p>This is the screen for creating a post. Enter text in the text area, click on the camera on the bottom to create a picture, or open your Photos from by tapping the right button on the bottom. The images appear in the lower part of the Post Editor, an image can be removed by doing a long press.\nIf you are finished with your post, tap the send button in the Navigation Header.</p>\n<h2>Profile</h2>\n<h2>Settings</h2>\n<h2>Channels</h2>\n<h2>TabBar</h2>\n<p>The TabBar is the main navigation menu in our application, it gives quick access to the following screens:</p>\n<ul>\n<li><a href=\"#Home\">Home</a></li>\n<li><a href=\"#Favorites\">Favorites</a></li>\n<li><a href=\"#Posting\">Post Editor</a></li>\n<li><a href=\"#Profile\">Profile</a></li>\n<li><a href=\"#Settings\">Settings</a></li>\n</ul>\n<h2>Post</h2>\n<h2>AddChannel</h2>","frontmatter":{"title":"Felfele User Manual 1.0.0","date":"May 11, 2019","path":"/blog/manual-1/"},"fields":{"slug":"/blog/manual-1/manual-1/"}}},"pageContext":{"slug":"/blog/manual-1/","previous":{"fields":{"slug":"/blog/hackathon/2019-01-02-hackathon/"},"frontmatter":{"title":"🚀 Product Design Hackathon #1 🚀","path":"/blog/hackathon/"}},"next":{"fields":{"slug":"/blog/alpha/alpha/"},"frontmatter":{"title":"Releasing the Alpha","path":"/blog/alpha/"}}}}